ConfigurationServiceDesk/src/Documents/ОбращениеПользователя/ОбращениеПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбращениеПользователя</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ПользователиИТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.СервисыИТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителей</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРеакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокРешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияВРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сообщения</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ПользователиИТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationServiceDesk/src/Catalogs/Исполнители/Исполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Исполнители</name>
  <attributes>
    <name>ПользовательСистемы</name>
    <type>
      <types>CatalogRef.ПользователиИТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConfigurationServiceDesk/src/Documents/ОбращениеПользователя/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  
  УстановитьФильтрациюПоРолям();
  
КонецПроцедуры

&НаКлиенте
Процедура ТестФонового(Команда)
    ТестФоновогоНаСервере();
    Сообщить("Проверка завершена!");
КонецПроцедуры

&НаСервере
Процедура ТестФоновогоНаСервере()
    // Вызываем вашу процедуру напрямую
    ФоновыеЗаданияСервисДеск.ПроверитьПросрочкуSLA();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // Форма будет обновлять список сама каждые 60 секунд
    ПодключитьОбработчикОжидания("ОбновитьСписокАвтоматически", 60);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокАвтоматически()
    Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрациюПоРолям()
  
  // Очищаем существующие отборы, чтобы они не дублировались
  Список.Отбор.Элементы.Очистить();

  // 1. АДМИНИСТРАТОР
  // Если пользователь — Администратор, он видит абсолютно всё без фильтров
  Если РольДоступна("Администратор") Тогда
    Возврат; 
  КонецЕсли;

  // Получаем данные текущей сессии для поиска соответствий
  ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
  ПолноеИмя = ТекущийПользовательИБ.ПолноеИмя;
  
  СсылкаНаПользователя = Справочники.ПользователиИТ.НайтиПоНаименованию(ПолноеИмя);

  // 2. ИСПОЛНИТЕЛЬ
  // Видит свои заявки или заявки своей группы
  Если РольДоступна("Исполнитель") Тогда
    
    // Находим ссылку в справочнике "Исполнители"
    // Ищем по имени или по привязке к пользователю системы
    МояСсылкаИсполнитель = Справочники.Исполнители.НайтиПоНаименованию(ПолноеИмя);
    
    Если МояСсылкаИсполнитель.Пустая() Тогда
      МояСсылкаИсполнитель = Справочники.Исполнители.НайтиПоРеквизиту("ПользовательСистемы", ТекущийПользовательИБ);
    КонецЕсли;

    // Создаем группу "ИЛИ", чтобы видеть и личные, и групповые задачи
    ГруппаИЛИ = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    ГруппаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
    
    // Фильтр: Я указан как исполнитель
    ОтборЛичный = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЛичный.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнитель");
    ОтборЛичный.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборЛичный.ПравоеЗначение = МояСсылкаИсполнитель;
    
    // Фильтр: Группа документа = Моя группа
    Если ЗначениеЗаполнено(МояСсылкаИсполнитель) Тогда
      ОтборГрупповой = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
      ОтборГрупповой.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГруппаИсполнителей");
      ОтборГрупповой.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
      ОтборГрупповой.ПравоеЗначение = МояСсылкаИсполнитель.Группа;
    КонецЕсли;
    
    Возврат; 
  КонецЕсли;

  // 3. ПОЛЬЗОВАТЕЛЬ (Ваш обновленный блок)
  // Видит только те обращения, которые создал сам (где он указан в поле "Пользователь")
  Если РольДоступна("Пользователь") Тогда
    
    ОтборПользователь = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборПользователь.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь"); 
    ОтборПользователь.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    
    // ПРОБЛЕМА ТУТ: Если поле "Пользователь" в документе - Ссылка, то сравниваем со Ссылкой.
    // Если это Строка - сравниваем со Строкой (ПолноеИмя).
    Если ЗначениеЗаполнено(СсылкаНаПользователя) Тогда
      ОтборПользователь.ПравоеЗначение = СсылкаНаПользователя;
    Иначе
      ОтборПользователь.ПравоеЗначение = ПолноеИмя;
    КонецЕсли;
    
    ОтборПользователь.Использование = Истина;
    
  КонецЕсли;
  
  // 4. НАБЛЮДАТЕЛЬ
  // Видит задачи, в которых он включен в список наблюдателей
  Если РольДоступна("Наблюдатель") Тогда
    
    // СсылкаНаПользователя у нас уже определена в начале процедуры через Справочники.ПользователиИТ
    
    // Создаем отбор по табличной части
    // Динамический список позволяет обращаться к ТЧ через точку: "ИмяТаблицы.ИмяПоля"
    ОтборНаблюдатель = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборНаблюдатель.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Наблюдатели.Пользователь");
    ОтборНаблюдатель.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    ОтборНаблюдатель.ПравоеЗначение = СсылкаНаПользователя;
    
    ОтборНаблюдатель.Использование  = Истина;
    
    // Если вы хотите, чтобы наблюдатель видел И те задачи, где он наблюдатель, 
    // И те, которые он сам создал (как обычный пользователь),
    // то этот блок нужно объединить с блоком "Пользователь" через Группу "ИЛИ".
    // Но если это строго раздельные роли, то оставляем Возврат.
    Возврат; 
  КонецЕсли;
  
КонецПроцедуры
